#+TITLE: Time Series Data Analysis
#+DATE: <2017-12-4 Mon 20:00>
#+AUTHOR: Qike Max Li
#+EMAIL: qikeli@gmail.com
#+SETUPFILE: ../setup/theme-readtheorg-local.setup


** Get a feeling of the data

#+BEGIN_SRC R :exports both :results output :session 
## load the libraries
library(tidyverse)
library(ggplot2)
library(astsa)
library(imputeTS)                       # to impute missing values
library(lubridate)
library(parallel)                       # to parallelize computation

## read in data
dat1 <- suppressMessages(read_csv('../Data/data.csv')) %>%
    mutate(day.of.week = factor(day.of.week,
                                   levels = c( "Monday", 
                                               "Tuesday",
                                               "Wednesday",
                                               "Thursday",
                                               "Friday",
                                               "Saturday",
                                              "Sunday")),
           cloud.indicator = factor(cloud.indicator))
#+END_SRC

#+RESULTS:
#+begin_example
Warning message:
package ‘astsa’ was built under R version 3.3.2
Warning message:
package ‘imputeTS’ was built under R version 3.3.2

Attaching package: ‘lubridate’

The following object is masked from ‘package:base’:

    date
#+end_example

- Print the first few rows of the data
#+BEGIN_SRC R :exports both :results output :session
dat1
#+END_SRC

- Summarize each column of the data
#+BEGIN_SRC R :exports both :results output :session
summary(dat1)
#+END_SRC

There are five columns in the data, and approximately 40% of the data are collected from cloudy days. It is unclear how weather affects car counts. 
